StratifyLabs/StratifyOS-mcu-stm32/src/usb_otg_fs_dev.c
/* Copyright 2011-2018 Tyler Gilbert;
 * This file is part of Stratify OS.
 *
 * Stratify OS is free software: you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation, either version 3 of the License, or
 * (at your option) any later version.
 *
 * Stratify OS is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with Stratify OS.  If not, see <http://www.gnu.org/licenses/>.
 *
 *
 */

#include <fcntl.h>
#include <mcu/usb.h>
#include <mcu/pio.h>
#include <cortexm/cortexm.h>
#include <usbd/types.h>
#include <mcu/core.h>
#include <mcu/debug.h>
#include <mcu/boot_debug.h>
#include <usbd/types.h>

#include "stm32_local.h"

#if MCU_USB_PORTS > 0

static void usb_connect(u32 port, u32 con);
static void usb_configure(const devfs_handle_t * handle, u32 cfg);
static void usb_set_address(const devfs_handle_t * handle, u32 addr);
static void usb_reset_endpoint(const devfs_handle_t * handle, u32 endpoint_num);
static void usb_flush_endpoint(const devfs_handle_t * handle, u32 endpoint_num);
static void usb_enable_endpoint(const devfs_handle_t * handle, u32 endpoint_num);
static void usb_disable_endpoint(const devfs_handle_t * handle, u32 endpoint_num);
static void usb_stall_endpoint(const devfs_handle_t * handle, u32 endpoint_num);
static void usb_unstall_endpoint(const devfs_handle_t * handle, u32 endpoint_num);
static void usb_configure_endpoint(const devfs_handle_t * handle, u32 endpoint_num, u32 max_packet_size, u8 type);
static void usb_reset(const devfs_handle_t * handle);

typedef struct MCU_PACK {
	PCD_HandleTypeDef hal_handle;
	devfs_transfer_handler_t transfer_handler[DEV_USB_LOGICAL_ENDPOINT_COUNT];
	mcu_event_handler_t control_handler;
	u16 rx_count[DEV_USB_LOGICAL_ENDPOINT_COUNT];
	u16 rx_buffer_offset[DEV_USB_LOGICAL_ENDPOINT_COUNT];
	u16 rx_buffer_used;
	volatile u32 write_pending;
	volatile u32 read_ready;
	mcu_event_handler_t special_event_handler;
	u8 ref_count;
	u8 connected;
} usb_local_t;

static usb_local_t m_usb_local[MCU_USB_PORTS] MCU_SYS_MEM;

static USB_OTG_GlobalTypeDef * const usb_regs_table[MCU_USB_PORTS] = MCU_USB_REGS;
static u8 const usb_irqs[MCU_USB_PORTS] = MCU_USB_IRQS;
static void clear_callbacks();

void clear_callbacks(int port){
	memset(m_usb_local[port].transfer_handler, 0, (DEV_USB_LOGICAL_ENDPOINT_COUNT) * sizeof(devfs_transfer_handler_t));
	memset(&m_usb_local[port].control_handler, 0, sizeof(mcu_event_handler_t));
	memset(&m_usb_local[port].special_event_handler, 0, sizeof(mcu_event_handler_t));
	memset(m_usb_local[port].rx_buffer_offset, 0, DEV_USB_LOGICAL_ENDPOINT_COUNT * sizeof(u16));
	m_usb_local[port].rx_buffer_used = 0;
}

DEVFS_MCU_DRIVER_IOCTL_FUNCTION(usb, USB_VERSION, USB_IOC_IDENT_CHAR, I_MCU_TOTAL + I_USB_TOTAL, mcu_usb_isconnected)


int mcu_usb_open(const devfs_handle_t * handle){
	u32 port = handle->port;
	if ( m_usb_local[port].ref_count == 0 ){
		//Set callbacks to NULL
		m_usb_local[port].connected = 0;
		clear_callbacks(handle->port);
		m_usb_local[port].hal_handle.Instance = usb_regs_table[port];

		if( port == 0 ){
#if MCU_USB_API > 0
			__HAL_RCC_USB_OTG_FS_CLK_ENABLE();
#else
			__HAL_RCC_USB_CLK_ENABLE();
#endif
		} else {
#if MCU_USB_PORTS > 1
#if defined __HAL_RCC_OTGPHYC_CLK_ENABLE
			__HAL_RCC_OTGPHYC_CLK_ENABLE();
#endif
			__HAL_RCC_USB_OTG_HS_CLK_ENABLE();
			__HAL_RCC_USB_OTG_HS_ULPI_CLK_ENABLE();
#endif
		}
		cortexm_enable_irq(usb_irqs[port]);  //Enable USB IRQ
	}
	m_usb_local[port].ref_count++;
	return 0;
}

int mcu_usb_close(const devfs_handle_t * handle){
	u32 port = handle->port;
	if ( m_usb_local[port].ref_count > 0 ){
		if ( m_usb_local[port].ref_count == 1 ){
			HAL_PCD_Stop(&m_usb_local[port].hal_handle);
			cortexm_disable_irq(usb_irqs[port]);  //Disable the USB interrupt
			m_usb_local[port].hal_handle.Instance = 0;
			if( port == 0 ){
#if MCU_USB_API > 0
				__HAL_RCC_USB_OTG_FS_CLK_DISABLE();
#else
				__HAL_RCC_USB_CLK_DISABLE();
#endif
			} else {
#if MCU_USB_PORTS > 1
#if defined __HAL_RCC_OTGPHYC_CLK_DISABLE
				__HAL_RCC_OTGPHYC_CLK_DISABLE();
#endif
				__HAL_RCC_USB_OTG_HS_CLK_DISABLE();
				__HAL_RCC_USB_OTG_HS_ULPI_CLK_DISABLE();
#endif
			}
		}
		m_usb_local[port].ref_count--;
	}
	return 0;
}

int mcu_usb_getinfo(const devfs_handle_t * handle, void * ctl){
	usb_info_t * info = ctl;

	info->o_flags = 0;
	info->o_events = 0;
	return 0;
}

int mcu_usb_setattr(const devfs_handle_t * handle, void * ctl){
	u32 port = handle->port;

	const usb_attr_t * attr = mcu_select_attr(handle, ctl);
	if( attr == 0 ){ return SYSFS_SET_RETURN(ENOSYS); }
	u32 o_flags = attr->o_flags;


	if( o_flags & USB_FLAG_SET_DEVICE ){
		//Start the USB clock
		int result;
		mcu_core_setusbclock(attr->freq);

		m_usb_local[port].read_ready = 0;
		m_usb_local[port].write_pending = 0;


		result = mcu_set_pin_assignment(
					&(attr->pin_assignment),
					MCU_CONFIG_PIN_ASSIGNMENT(usb_config_t, handle),
					MCU_PIN_ASSIGNMENT_COUNT(usb_pin_assignment_t),
					CORE_PERIPH_USB, port, 0, 0, 0);

		if( result < 0 ){ return result; }

#if defined STM32L4
		if(__HAL_RCC_PWR_IS_CLK_DISABLED()){
			__HAL_RCC_PWR_CLK_ENABLE();
			HAL_PWREx_EnableVddUSB();
			__HAL_RCC_PWR_CLK_DISABLE();
		} else {
			HAL_PWREx_EnableVddUSB();
		}
#endif

		if( port == 0 ){
			m_usb_local[port].hal_handle.Init.dev_endpoints = 9;
			m_usb_local[port].hal_handle.Init.speed = PCD_SPEED_FULL;
			m_usb_local[port].hal_handle.Init.phy_itface = PCD_PHY_EMBEDDED;
		} else {
#if MCU_USB_PORTS > 1
			m_usb_local[port].hal_handle.Init.dev_endpoints = DEV_USB_LOGICAL_ENDPOINT_COUNT;
			if( o_flags & USB_FLAG_IS_HIGH_SPEED ){
				m_usb_local[port].hal_handle.Init.speed = USB_OTG_SPEED_HIGH;
			} else {
				m_usb_local[port].hal_handle.Init.speed = USB_OTG_SPEED_HIGH_IN_FULL;
			}

			//Need a flag to check for HW interface
			m_usb_local[port].hal_handle.Init.phy_itface = USB_OTG_HS_EMBEDDED_PHY;
#endif
		}
		m_usb_local[port].hal_handle.Init.dma_enable = DISABLE;
		m_usb_local[port].hal_handle.Init.ep0_mps = DEP0CTL_MPS_64;
		if ( attr->max_packet_size <= 8 ){
			m_usb_local[port].hal_handle.Init.ep0_mps = DEP0CTL_MPS_8;
		} else if ( attr->max_packet_size <= 16 ){
			m_usb_local[port].hal_handle.Init.ep0_mps = DEP0CTL_MPS_16;
		} else if ( attr->max_packet_size <= 32 ){
			m_usb_local[port].hal_handle.Init.ep0_mps = DEP0CTL_MPS_32;
		}

		m_usb_local[port].hal_handle.Init.Sof_enable = DISABLE;
		m_usb_local[port].hal_handle.Init.low_power_enable = DISABLE;

#if !defined STM32F2
		m_usb_local[port].hal_handle.Init.lpm_enable = DISABLE;
		m_usb_local[port].hal_handle.Init.battery_charging_enable = DISABLE;
#endif

#if MCU_USB_API > 0
		m_usb_local[port].hal_handle.Init.vbus_sensing_enable = DISABLE;
		m_usb_local[port].hal_handle.Init.use_dedicated_ep1 = DISABLE;
		m_usb_local[port].hal_handle.Init.use_external_vbus = DISABLE;

		if( o_flags & USB_FLAG_IS_VBUS_SENSING_ENABLED ){
			m_usb_local[port].hal_handle.Init.vbus_sensing_enable = ENABLE;
		}
#endif

		if( o_flags & USB_FLAG_IS_SOF_ENABLED ){
			m_usb_local[port].hal_handle.Init.Sof_enable = ENABLE;
		}

#if !defined STM32F2
		if( o_flags & USB_FLAG_IS_LOW_POWER_MODE_ENABLED ){
			m_usb_local[port].hal_handle.Init.lpm_enable = ENABLE;
		}

		if( o_flags & USB_FLAG_IS_BATTERY_CHARGING_ENABLED ){
			m_usb_local[port].hal_handle.Init.battery_charging_enable = ENABLE;
		}
#endif

		if( HAL_PCD_Init(&m_usb_local[port].hal_handle) != HAL_OK ){
			return SYSFS_SET_RETURN(EIO);
		}

#if MCU_USB_API > 0
		int i;
		HAL_PCDEx_SetRxFiFo(&m_usb_local[port].hal_handle, attr->rx_fifo_word_size);  //size is in 32-bit words for all fifo - 512
		for(i=0; i < USB_TX_FIFO_WORD_SIZE_COUNT; i++){
			if( attr->tx_fifo_word_size[i] > 0 ){
				HAL_PCDEx_SetTxFiFo(&m_usb_local[port].hal_handle, i, attr->tx_fifo_word_size[i]);
			}
		}
#else

#if 1
		HAL_PCDEx_PMAConfig(&m_usb_local[port].hal_handle, 0x00 , PCD_SNG_BUF, 0x18);  //why do we start 24 bytes in?
		HAL_PCDEx_PMAConfig(&m_usb_local[port].hal_handle, 0x80 , PCD_SNG_BUF, 0x18+64); //64 bytes for 00

		HAL_PCDEx_PMAConfig(&m_usb_local[port].hal_handle, 0x81 , PCD_SNG_BUF, 0x18+64+64); //interrupt in
		HAL_PCDEx_PMAConfig(&m_usb_local[port].hal_handle, 0x82 , PCD_SNG_BUF, 0x18+64+64+64); //bulk input -- sending data to computer
		HAL_PCDEx_PMAConfig(&m_usb_local[port].hal_handle, 0x02 , PCD_SNG_BUF, 0x18+64+64+64+64); //bulk output -- receiving data from computer
#else
		HAL_PCDEx_PMAConfig(&m_usb_local[port].hal_handle , 0x00 , PCD_SNG_BUF, 0x18);
		HAL_PCDEx_PMAConfig(&m_usb_local[port].hal_handle , 0x80 , PCD_SNG_BUF, 0x58);
		HAL_PCDEx_PMAConfig(&m_usb_local[port].hal_handle , 0x81 , PCD_SNG_BUF, 0xC0);
		HAL_PCDEx_PMAConfig(&m_usb_local[port].hal_handle , 0x01 , PCD_SNG_BUF, 0x110);
		HAL_PCDEx_PMAConfig(&m_usb_local[port].hal_handle , 0x82 , PCD_SNG_BUF, 0x100);
#endif

#endif
	}


	if( o_flags & USB_FLAG_RESET ){ usb_reset(handle); }
	if( o_flags & USB_FLAG_ATTACH ){ usb_connect(port, 1); }
	if( o_flags & USB_FLAG_DETACH ){ usb_connect(port, 0); }
	if( o_flags & USB_FLAG_CONFIGURE ){ usb_configure(handle, 1); }
	if( o_flags & USB_FLAG_UNCONFIGURE ){ usb_configure(handle, 0); }

