StratifyLabs/StratifyOS-mcu-stm32/src/usb_otg_fs_dev.c
	if( o_flags & USB_FLAG_SET_ADDRESS ){
		usb_set_address(handle, attr->address);
	}

	if( o_flags & USB_FLAG_RESET_ENDPOINT ){
		usb_reset_endpoint(handle, attr->address);
	}

	if( o_flags & USB_FLAG_ENABLE_ENDPOINT ){
		usb_enable_endpoint(handle, attr->address);
	}

	if( o_flags & USB_FLAG_FLUSH_ENDPOINT ){
		usb_flush_endpoint(handle, attr->address);
	}

	if( o_flags & USB_FLAG_DISABLE_ENDPOINT ){
		usb_disable_endpoint(handle, attr->address);
	}

	if( o_flags & USB_FLAG_STALL_ENDPOINT ){
		usb_stall_endpoint(handle, attr->address);
	}

	if( o_flags & USB_FLAG_UNSTALL_ENDPOINT ){
		usb_unstall_endpoint(handle, attr->address);
	}

	if( o_flags & USB_FLAG_CONFIGURE_ENDPOINT ){
		usb_configure_endpoint(handle, attr->address, attr->max_packet_size, attr->type);
	}

	return 0;
}

void usb_connect(u32 port, u32 con){
	if( con ){
		HAL_PCD_Start(&m_usb_local[port].hal_handle);
#if defined STM32H7
		HAL_PWREx_EnableUSBVoltageDetector();
#endif
	} else {
		HAL_PCD_Stop(&m_usb_local[port].hal_handle);
	}
}

int mcu_usb_setaction(const devfs_handle_t * handle, void * ctl){
	u32 port = handle->port;
	mcu_action_t * action = (mcu_action_t*)ctl;
	int log_ep;
	int ret = -1;

	//cortexm_set_irq_prio(USB_IRQn, action->prio);
	log_ep = action->channel & ~0x80;

	cortexm_set_irq_priority(usb_irqs[port], action->prio, action->o_events);

	if( action->o_events &
		 (MCU_EVENT_FLAG_POWER|MCU_EVENT_FLAG_SUSPEND|MCU_EVENT_FLAG_STALL|MCU_EVENT_FLAG_SOF|MCU_EVENT_FLAG_WAKEUP)
		 ){
		m_usb_local[port].special_event_handler = action->handler;
		return 0;
	}

	if( action->channel & 0x80 ){
		if( (action->handler.callback == 0) && (action->o_events & MCU_EVENT_FLAG_WRITE_COMPLETE) ){
			m_usb_local[port].write_pending &= ~(1<<log_ep);
			if( log_ep > 0 ){
				devfs_execute_cancel_handler(&(m_usb_local[port].transfer_handler[log_ep]), 0, SYSFS_SET_RETURN(ECANCELED), MCU_EVENT_FLAG_CANCELED);
			} else {
				mcu_execute_event_handler(&(m_usb_local[port].control_handler), MCU_EVENT_FLAG_CANCELED, 0);
			}
		}
	} else {
		if( (action->handler.callback == 0) && (action->o_events & MCU_EVENT_FLAG_DATA_READY) ){
			m_usb_local[port].read_ready |= (1<<log_ep);
			if( log_ep > 0 ){
				devfs_execute_cancel_handler(&(m_usb_local[port].transfer_handler[log_ep]), 0, SYSFS_SET_RETURN(ECANCELED), MCU_EVENT_FLAG_CANCELED);
			} else {
				mcu_execute_event_handler(&(m_usb_local[port].control_handler), MCU_EVENT_FLAG_CANCELED, 0);
			}
		}
	}

	if ( (log_ep < DEV_USB_LOGICAL_ENDPOINT_COUNT)  ){
		if( action->o_events & MCU_EVENT_FLAG_DATA_READY ){
			//cortexm_enable_interrupts();
			if( cortexm_validate_callback(action->handler.callback) < 0 ){
				return SYSFS_SET_RETURN(EPERM);
			}

			if( log_ep == 0 ){
				if( action->o_events & MCU_EVENT_FLAG_SETUP ){
					m_usb_local[port].control_handler = action->handler;
				} else {
					return SYSFS_SET_RETURN(EINVAL);
				}
			} else {
				return SYSFS_SET_RETURN(EINVAL);
			}
			ret = 0;
		}

		if( action->o_events & MCU_EVENT_FLAG_WRITE_COMPLETE ){
			if( cortexm_validate_callback(action->handler.callback) < 0 ){
				return SYSFS_SET_RETURN(EPERM);
			}

			if( log_ep == 0 ){
				if( action->o_events & MCU_EVENT_FLAG_SETUP ){
					m_usb_local[port].control_handler = action->handler;
				} else {
					return SYSFS_SET_RETURN(EINVAL);
				}
			} else {
				return SYSFS_SET_RETURN(EINVAL);
			}
			ret = 0;
		}
	}

	if( ret < 0 ){
		ret = SYSFS_SET_RETURN(EINVAL);
	}
	return ret;
}

int mcu_usb_read(const devfs_handle_t * handle, devfs_async_t * async){
	DEVFS_DRIVER_DECLARE_LOCAL(usb, MCU_USB_PORTS);

	int loc = async->loc;
	if ( loc > (DEV_USB_LOGICAL_ENDPOINT_COUNT-1) ){
		return SYSFS_SET_RETURN(EINVAL);
	}

	DEVFS_DRIVER_IS_BUSY(local->transfer_handler[loc].read, async);

	int result;

	//Synchronous read (only if data is ready) otherwise 0 is returned
	if ( local->read_ready & (1<<loc) ){
		result = mcu_usb_root_read_endpoint(handle, loc, async->buf);
		if( result == 0 ){
			result = SYSFS_SET_RETURN(EAGAIN);
		}
	} else {
		if ( !(async->flags & O_NONBLOCK) ){
			//If this is a blocking call, set the callback and context
			if( cortexm_validate_callback(async->handler.callback) < 0 ){
				result = SYSFS_SET_RETURN(EPERM);
			} else {
				result = 0;
			}
		} else {
			result = SYSFS_SET_RETURN(EAGAIN);
		}
	}

	if( result != 0 ){
		local->transfer_handler[loc].read = 0;
	}

	return result;
}

int mcu_usb_write(const devfs_handle_t * handle, devfs_async_t * async){
	//Asynchronous write
	DEVFS_DRIVER_DECLARE_LOCAL(usb, MCU_USB_PORTS);

	int loc = async->loc;
	int ep;
	ep = (loc & 0x7F);
	if ( ep > (DEV_USB_LOGICAL_ENDPOINT_COUNT-1) ){
		return SYSFS_SET_RETURN(EINVAL);
	}

	DEVFS_DRIVER_IS_BUSY(local->transfer_handler[ep].write, async);

	int bytes_written;


	if( cortexm_validate_callback(async->handler.callback) < 0 ){
		return SYSFS_SET_RETURN(EPERM);
	}

	local->write_pending |= (1<<ep);
	bytes_written = mcu_usb_root_write_endpoint(handle, loc, async->buf, async->nbyte);

	if ( bytes_written < 0 ){
		usb_disable_endpoint(handle, loc );
		usb_reset_endpoint(handle, loc );
		usb_enable_endpoint(handle, loc );
	}

	if( bytes_written != 0 ){
		local->transfer_handler[loc].write = 0;
		m_usb_local[port].write_pending &= ~(1<<ep);
	}

	return bytes_written;
}


void usb_reset(const devfs_handle_t * handle){

}

void usb_wakeup(int port){

}

void usb_set_address(const devfs_handle_t * handle, u32 addr){
	HAL_PCD_SetAddress(&m_usb_local[handle->port].hal_handle, addr);
}

void usb_configure(const devfs_handle_t * handle, u32 cfg){
	m_usb_local[handle->port].connected = 1;
}

void usb_configure_endpoint(const devfs_handle_t * handle, u32 endpoint_num, u32 max_packet_size, u8 type){
	u32 port = handle->port;
	const stm32_config_t * stm32_config = mcu_board_config.arch_config;

	HAL_PCD_EP_Open(&m_usb_local[handle->port].hal_handle, endpoint_num, max_packet_size, type & EP_TYPE_MSK);
	m_usb_local[handle->port].connected = 1;

	if( (endpoint_num & 0x80) == 0 ){
		void * dest_buffer;

