StratifyLabs/StratifyOS-mcu-stm32/src/usb_otg_fs_dev.c
		m_usb_local[port].rx_buffer_offset[endpoint_num] = m_usb_local[port].rx_buffer_used;
		m_usb_local[port].rx_buffer_used += (max_packet_size*2);
		if( m_usb_local[port].rx_buffer_used > stm32_config->usb_rx_buffer_size ){
			//this is a fatal error
			mcu_board_execute_event_handler(MCU_BOARD_CONFIG_EVENT_ROOT_FATAL, "usbbuf");
		}

		dest_buffer = stm32_config->usb_rx_buffer +
				m_usb_local[port].rx_buffer_offset[endpoint_num] +
				max_packet_size;

		HAL_PCD_EP_Receive(&m_usb_local[port].hal_handle, endpoint_num, dest_buffer, max_packet_size);
	}
}

void usb_enable_endpoint(const devfs_handle_t * handle, u32 endpoint_num){
}

void usb_disable_endpoint(const devfs_handle_t * handle, u32 endpoint_num){
	HAL_PCD_EP_Close(&m_usb_local[handle->port].hal_handle, endpoint_num);
}

void usb_reset_endpoint(const devfs_handle_t * handle, u32 endpoint_num){
}

void usb_flush_endpoint(const devfs_handle_t * handle, u32 endpoint_num){
	PCD_HandleTypeDef * hpcd = &m_usb_local[handle->port].hal_handle;
	u8 logical_endpoint = endpoint_num & ~0x80;

	if( ((endpoint_num & 0x80) && (hpcd->IN_ep[logical_endpoint].type == EP_TYPE_ISOC)) ){
		HAL_PCD_EP_Close(hpcd, endpoint_num);
		HAL_PCD_EP_Open(hpcd, endpoint_num, hpcd->IN_ep[logical_endpoint].maxpacket, EP_TYPE_ISOC);
	} else if( (((endpoint_num & 0x80) == 0) && (hpcd->OUT_ep[logical_endpoint].type == EP_TYPE_ISOC)) ){
		HAL_PCD_EP_Close(hpcd, endpoint_num);
		HAL_PCD_EP_Open(hpcd, endpoint_num, hpcd->OUT_ep[logical_endpoint].maxpacket, EP_TYPE_ISOC);
	}
	HAL_PCD_EP_Flush(hpcd, endpoint_num);

}

void usb_stall_endpoint(const devfs_handle_t * handle, u32 endpoint_num){
	HAL_PCD_EP_SetStall(&m_usb_local[handle->port].hal_handle, endpoint_num);
}

void usb_unstall_endpoint(const devfs_handle_t * handle, u32 endpoint_num){
	HAL_PCD_EP_ClrStall(&m_usb_local[handle->port].hal_handle, endpoint_num);
}

int mcu_usb_isconnected(const devfs_handle_t * handle, void * ctl){
	return m_usb_local[handle->port].connected;
}

void usb_clr_ep_buf(const devfs_handle_t * handle, u32 endpoint_num){

}

int mcu_usb_root_read_endpoint(const devfs_handle_t * handle, u32 endpoint_num, void * dest){
	u32 port = handle->port;
	const stm32_config_t * stm32_config = mcu_board_config.arch_config;
	void * src_buffer;
	u8 epnum;
	epnum = endpoint_num & 0x7f;

	if( m_usb_local[port].read_ready & (1<<epnum) ){
		m_usb_local[port].read_ready &= ~(1<<epnum);
		src_buffer = stm32_config->usb_rx_buffer + m_usb_local[port].rx_buffer_offset[epnum];
		//data is copied from fifo to buffer during the interrupt
		memcpy(dest, src_buffer, m_usb_local[port].rx_count[epnum]);
		return m_usb_local[port].rx_count[epnum];
	}

	return -1;
}

int mcu_usb_root_write_endpoint(const devfs_handle_t * handle, u32 endpoint_num, const void * src, u32 size){
	int ret;

#if MCU_USB_API > 0
	int logical_endpoint = endpoint_num & 0x7f;
	int type = m_usb_local[handle->port].hal_handle.IN_ep[logical_endpoint].type;
	if( type == EP_TYPE_ISOC ){
		//check to see if the packet will fit in the FIFO
		//if the packet won't fit, return EBUSY
		USB_OTG_GlobalTypeDef * USBx = m_usb_local[handle->port].hal_handle.Instance;
		int available = (USBx_INEP(logical_endpoint)->DTXFSTS & USB_OTG_DTXFSTS_INEPTFSAV);
		if( (available * 4) < size ){
			return SYSFS_SET_RETURN(EBUSY);
		}
	}
#endif

	ret = HAL_PCD_EP_Transmit(&m_usb_local[handle->port].hal_handle, endpoint_num, (void*)src, size);
	if( ret == HAL_OK ){
#if 0
		if( type == EP_TYPE_ISOC ){
			return size;
		}
#endif
		return 0;
	}

	return SYSFS_SET_RETURN(EIO);
}


void HAL_PCD_SetupStageCallback(PCD_HandleTypeDef *hpcd){
	usb_local_t * local = (usb_local_t *)hpcd;
	//a setup packet has been received
	const stm32_config_t * stm32_config = mcu_board_config.arch_config;
	usb_event_t event;
	event.epnum = 0;
	void * dest_buffer;
	usbd_setup_packet_t * setup = (usbd_setup_packet_t *)&hpcd->Setup;

	//Setup data is in hpcd->Setup buffer at this point

	//copy setup data to ep0 data buffer
	local->read_ready |= (1<<0);
	dest_buffer = stm32_config->usb_rx_buffer + local->rx_buffer_offset[0];
	local->rx_count[0] = sizeof(usbd_setup_packet_t);
	memcpy(dest_buffer, hpcd->Setup, local->rx_count[0]);

	mcu_execute_event_handler(&local->control_handler, MCU_EVENT_FLAG_SETUP, &event);

	//prepare EP zero for receiving out data

	if( (setup->bmRequestType.bitmap_t.dir == USBD_REQUEST_TYPE_DIRECTION_HOST_TO_DEVICE) && (setup->wLength > 0) ){
		HAL_PCD_EP_Receive(hpcd, 0, stm32_config->usb_rx_buffer, setup->wLength);
	}

}

void HAL_PCD_DataOutStageCallback(PCD_HandleTypeDef *hpcd, uint8_t epnum){
	usb_local_t * local = (usb_local_t *)hpcd;
	//data has already been received and is stored in buffer specified by HAL_PCD_EP_Receive
	const stm32_config_t * stm32_config = mcu_board_config.arch_config;
	usb_event_t event;
	event.epnum = epnum;
	u16 count;
	void * src_buffer;
	void * dest_buffer;

	//set read ready flag
	local->read_ready |= (1<<epnum);
	count = HAL_PCD_EP_GetRxCount(&local->hal_handle, epnum);

	dest_buffer = stm32_config->usb_rx_buffer + local->rx_buffer_offset[epnum];
	src_buffer = dest_buffer + hpcd->OUT_ep[epnum].maxpacket;

	local->rx_count[epnum] = count;
	if( epnum == 0 ){
		memcpy(dest_buffer, src_buffer, count);
		mcu_execute_event_handler(&local->control_handler, MCU_EVENT_FLAG_DATA_READY, &event);
	} else if( local->transfer_handler[epnum].read ){
		devfs_async_t * async = local->transfer_handler[epnum].read;
		if( count > async->nbyte ){ count = async->nbyte; }
		memcpy(local->transfer_handler[epnum].read->buf, src_buffer, count);
		local->read_ready &= ~(1<<epnum);
		devfs_execute_read_handler(local->transfer_handler + epnum, &event, count, 0);
	}

	//prepare to receive the next packet in the local buffer for non-control endpoints
	if( epnum != 0 ){
		HAL_PCD_EP_Receive(hpcd, epnum, src_buffer, hpcd->OUT_ep[epnum].maxpacket);
	}
}

void HAL_PCD_DataInStageCallback(PCD_HandleTypeDef *hpcd, uint8_t epnum){
	usb_local_t * local = (usb_local_t *)hpcd;
	u8 logical_ep = epnum & 0x7f;
	usb_event_t event;
	event.epnum = epnum;

	local->write_pending &= ~(1<<logical_ep);

