StratifyLabs/StratifyOS-mcu-stm32/src/usb_otg_fs_dev.c
	//devfs_execute_write_handler(usb->transfer_handlers + logical_ep, &event, 0, MCU_EVENT_FLAG_WRITE_COMPLETE);

	if( logical_ep == 0 ){
		//#if MCU_USB_API == 0

		mcu_execute_event_handler(&local->control_handler, MCU_EVENT_FLAG_WRITE_COMPLETE, &event);

		//only proceed it DataIn tx'd more than zero bytes
		if( hpcd->IN_ep[0].xfer_count == 0 ){
			return;
		}
		//#endif
		//ep 0 data in complete
		//prepare EP0 for next setup packet
		HAL_PCD_EP_Receive(hpcd, 0, 0, 0);
	} else {
		devfs_execute_write_handler(local->transfer_handler + logical_ep, &event, 0, 0);
	}

}

void HAL_PCD_SOFCallback(PCD_HandleTypeDef *hpcd){

}

void HAL_PCD_ResetCallback(PCD_HandleTypeDef *hpcd){
	int i;
	usb_local_t * usb = (usb_local_t *)hpcd;
	u32 mps = mcu_board_config.usb_max_packet_zero;
	usb->connected = 1;

	usb->rx_buffer_used = mps;
	for(i=0; i < DEV_USB_LOGICAL_ENDPOINT_COUNT; i++){
		usb->rx_buffer_offset[i] = 0;
	}

	HAL_PCD_EP_Open(hpcd, 0x00, mps, EP_TYPE_CTRL);
	HAL_PCD_EP_Open(hpcd, 0x80, mps, EP_TYPE_CTRL);


}

void HAL_PCD_SuspendCallback(PCD_HandleTypeDef *hpcd){
	usb_local_t * usb = (usb_local_t *)hpcd;
	usb->connected = 0;

#if MCU_USB_API > 0
	__HAL_PCD_GATE_PHYCLOCK(hpcd);
#endif

}

void HAL_PCD_ResumeCallback(PCD_HandleTypeDef *hpcd){
	usb_local_t * usb = (usb_local_t *)hpcd;
	usb->connected = 1;
}

void HAL_PCD_ISOINIncompleteCallback(PCD_HandleTypeDef *hpcd, uint8_t epnum){

	//epnum value passed is not valid -- need to find it
	int i;
	for(i=1; i < DEV_USB_LOGICAL_ENDPOINT_COUNT; i++){
		if( hpcd->IN_ep[i].type == EP_TYPE_ISOC ){

			epnum = 0x80 | i;
			u8 logical_ep = epnum & 0x7F;

			//Close will disable the endpoint and flush the TX FIFO
			if( HAL_PCD_EP_Close(hpcd, epnum) != HAL_OK ){

			}

			if( HAL_PCD_EP_Open(hpcd, epnum, hpcd->IN_ep[logical_ep].maxpacket, EP_TYPE_ISOC) != HAL_OK ){

			}

			usb_local_t * local = (usb_local_t *)hpcd;
			devfs_execute_write_handler(local->transfer_handler + logical_ep, 0, SYSFS_SET_RETURN(EIO), MCU_EVENT_FLAG_ERROR | MCU_EVENT_FLAG_CANCELED);
		}

	}
}

void HAL_PCD_ISOOUTIncompleteCallback(PCD_HandleTypeDef *hpcd, uint8_t epnum){
	//mcu_debug_printf("Iso out\n");
}

void HAL_PCD_ConnectCallback(PCD_HandleTypeDef *hpcd){
	MCU_UNUSED_ARGUMENT(hpcd);
	//this is never called -- Reset callback is called when connection is established
}

void HAL_PCD_DisconnectCallback(PCD_HandleTypeDef *hpcd){
	MCU_UNUSED_ARGUMENT(hpcd);
	//this is never called -- Suspend callback is called when connection is lost
}

void mcu_core_otg_fs_isr(){
	HAL_PCD_IRQHandler(&m_usb_local[0].hal_handle);
}

#if MCU_USB_PORTS > 1
void mcu_core_otg_hs_isr(){
	HAL_PCD_IRQHandler(&m_usb_local[1].hal_handle);
}
#endif

#endif








